Autodesk.Revit.DB.ViewSchedule.IsValidTextTypeId(Autodesk.Revit.DB.ElementId)
Identifies if the input id represents a valid text type id for use in the schedule properties.
textTypeId:
The element id of the text type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ViewSchedule.Export(System.String,System.String,Autodesk.Revit.DB.ViewScheduleExportOptions)
Exports the schedule data to a text file.
folder:
Path to the location where the file will be saved.
name:
Name of file.
options:
Options that relate to schedule export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The path indicated could not be accessed.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.SetStripedRowsColor(Autodesk.Revit.DB.StripedRowPattern,Autodesk.Revit.DB.Color)
Sets the color applied to part of the pattern for a schedule with striped rows.
index:
The part of the striped row pattern.
color:
The color which will be used in striped row pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.ViewSchedule.GetStripedRowsColor(Autodesk.Revit.DB.StripedRowPattern)
Gets the color applied to part of the pattern for a schedule with striped rows.
index:
The part of the striped row pattern.
Returns:
The applied color of the pattern part.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.ViewSchedule.RestoreImageSize
Restores all images to their original sizes.
Remarks:
All images in the schedule will be restored to their original sizes when viewed as a ScheduleSheetInstance on a ViewSheet.
This reverts any changes made by setting Autodesk.Revit.DB.ViewSchedule.RowHeight. Calling this method has no effect if HasImageField is false.
In the schedule view the column widths will be adjusted to match the image sizes, but only the name of the image will be shown.
For example, the users can attach different images to the kinds of rebar instances. These images may have different sizes.
When the users create the rebar schedule with this image field, by default the column width of this image field is equal to other fields,
which means it is not associated with the image original sizes during the schedule creation.
Since:
2015

Autodesk.Revit.DB.ViewSchedule.GroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32,System.String)
Groups schedule header cells.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
caption:
The header caption.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Headers could not be grouped.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ViewSchedule.GetScheduleHeightsOnSheet
Gets the heights of schedule title, column header and each schedule body row.
Remarks:
The height is Revit's internal units value.
Returns:
The ScheduleHeightsOnSheet which contains heights information of a schedule on sheet.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.MergeSegments(System.Int32,System.Int32)
Merges two adjacent segments into one.
Remarks:
Only adjacent segments can be merged. The moved segment will be deleted with all its instances
on sheet and all the data will be merged into the target segment with height expanded.
movedSegmentIndex:
The index of the moved segment.
targetSegmentIndex:
The index of the target segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Only two adjacent segments can be merged.
-or-
The segment index should start from 0 and be less than the total segment count.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.GetScheduleInstances(System.Int32)
Gets the instances ids of schedule or schedule segment.
Remarks:
The segment index value could be -1, it means to get schedule instances for the entire schedule.
When a (primary) schedule is set to filter by sheet and placed on a sheet, it will create a new schedule with elements visible
in the Viewport(s) on that sheet. The instance created belongs to the newly created schedule. Calls to GetScheduleInstances()
will return instances of the newly created schedule but no instances of the primary schedule.
segmentIndex:
Index of the segment.
Returns:
The array of schedule sheet instance element ids of schedule or schedule segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment index should start from -1 and be less than the total segment count.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.GetSegmentHeight(System.Int32)
Gets the segment height.
Remarks:
The height is Revit's internal units value of schedule header and segment body.
The real height of segment on sheet may be less than the segment height get here.
It is the border height of segment instance on sheet.
The last segment height get here is the max value of double as the last segment height is not set
to a fix value. It will be determined by whole schedule height and other segments' heights. And the border for it is max value of double.
segmentIndex:
Zero-based index of the segment.
Returns:
The segment height value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment index should start from 0 and be less than the total segment count.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.SetSegmentHeight(System.Int32,System.Double)
Sets the segment height.
Remarks:
The height is Revit's internal units value of schedule header and segment body.
The last segment can not set height. Its height will be determined by whole schedule height and other segments' heights.
The height will not be the exact segment height on sheet. It will be the border height of the instance. The real height
will be determined by the segment content. If the row cannot be shown within the instance boder, it will flow to the next segment.
segmentIndex:
Index of the segment.
height:
New height for the segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
segmentIndex must be between 0 and the last second of all segments.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.GetSegmentCount
Gets the total count of schedule segments.
Remarks:
There will be at least one segment for a schedule.
Returns:
The total count of schedule segments. 1 means the schedule is not split yet.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.DeleteSegment(System.Int32)
Deletes a schedule segment.
Remarks:
If the last segment is deleted, the previous one will be the last one and its height will be modified to unlimited.
If one segment is deleted when there are only two segments, all the instances will be deleted and the schedule
will become unsplit again.
segmentIndex:
Zero-based index of the segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment index should start from 0 and be less than the total segment count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ViewSchedule is not split yet.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.SplitSegment(System.Int32,System.Collections.Generic.IList{System.Double})
Splits the schedule segment by the given heights of new segments.
Remarks:
The height values are used to set the height of schedule instance for each segment shown on sheet view.
Each input height must be greater than 0 and the total height must be less than the height of the split segment.
segmentIndex:
The index of segment, starting with 0.
segmentHeights:
An array contains the height for each new segment except the last segment.
The height of the last segment will be determined by the height of previous new segments and the height of the split segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The height of a schedule segment must be greater than 0. The total height must be less than the split segment height.
The total segment count must be greater than 0 and less than 10000.
-or-
The segment index should start from 0 and be less than the total segment count.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ViewSchedule is not split yet.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.Split(System.Collections.Generic.IList{System.Double})
Splits the schedule into several segments by given height of each segment.
Remarks:
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once a sheet specific schedule, i.e., the schedule is filtered by sheet, is split,
the segments will be placed on its sheet view immediately.
The height values are used to set the height limits of the schedule instances of each segment
except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule instances of the last segment
will be determined by the schedule instances of previous segments and the height of the whole schedule.
All height values must be greater than 0.
Also check setSegmentHeight.
segmentHeights:
An array contains the height limit of each segment except the last segment.
The height is the value for segment body.
The height is Revit's internal units value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The height of a schedule segment must be greater than 0 and no more than 30000 feet. The total segment count must be greater than 0 and less than 10000.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revision schedules cannot be split.
-or-
A schedule filtered by sheet can't be split.
-or-
This ViewSchedule is split.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.Split(System.Int32)
Splits the schedule into several segments by given segment number.
Remarks:
The segment number must be greater than 0.
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once a sheet specific schedule, i.e., the schedule is filtered by sheet, is split,
the segments will be placed on its sheet view immediately.
After split, all segments will have even height limits based on the schedule height and segment number
except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule
instances of the last segment will be determined by the schedule instances of previous
segments and the height of the whole schedule.
Check Autodesk.Revit.DB.ViewSchedule.SetSegmentHeight(System.Int32,System.Double) to see more about segment height.
segmentNumber:
The segment number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment number must be greater than 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revision schedules cannot be split.
-or-
A schedule filtered by sheet can't be split.
-or-
This ViewSchedule is split.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.IsSplit
Checks if the schedule is split.
Returns:
True if the schedule is split. Otherwise false.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForNoteBlock(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a note block.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForRevisionSchedule(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a revision schedule.
document:
The titleblock family document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a titleblock family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForKeynoteLegend(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a keynote legend.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSheetList(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a sheet list.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForViewList(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a view list.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a material takeoff.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a material takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultParameterNameForKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default parameter name that will be used when creating a key schedule.
Remarks:
See ViewSchedule.KeyScheduleParameterName for details.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The default parameter name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a key schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
areaSchemeId:
The ID of an area scheme in an area schedule, InvalidElementId otherwise.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
In a non-area schedule, areaSchemeId is not InvalidElementId.
-or-
In an area schedule, areaSchemeId is not the ID of an area scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a regular schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
The Areas category was specified but an area scheme ID was not provided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetValidFamiliesForNoteBlock(Autodesk.Revit.DB.Document)
Gets a list of families that can be used for a note block.
document:
The document.
Returns:
The IDs of all valid families.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidFamilyForNoteBlock(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether a family can be used for a note block.
document:
The document.
familyId:
The family ID to check.
Returns:
True if the family can be used for a note block,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForMaterialTakeoff(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a material takeoff.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a material takeoff,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForKeySchedule(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a key schedule.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a key schedule,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForSchedule(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a regular schedule.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a regular schedule,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateNoteBlock(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a note block.
Remarks:
A note block is a schedule of the Generic Annotations category
that shows elements of a single family rather than all elements
in the category.
document:
The document to which the new schedule will be added.
familyId:
The ID of the family whose elements will be included in the schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
familyId is not a valid family for a note block.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateRevisionSchedule(Autodesk.Revit.DB.Document)
Creates a revision schedule.
Remarks:
Revision schedules are added to titleblock families and become
visible as part of titleblocks on sheets.
document:
The titleblock family document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a titleblock family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateKeynoteLegend(Autodesk.Revit.DB.Document)
Creates a keynote legend.
Remarks:
A keynote legend is a schedule of the Keynote Tags category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSheetList(Autodesk.Revit.DB.Document)
Creates a sheet list.
Remarks:
A sheet list is a schedule of sheets in the project.
It is a schedule of the Sheets category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateViewList(Autodesk.Revit.DB.Document)
Creates a view list.
Remarks:
A view list is a schedule of views in the project.
It is a schedule of the Views category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a material takeoff.
Remarks:
A material takeoff is a schedule that displays information about
the materials that make up elements in the model.  Unlike regular
schedules where each row (before grouping) represents a single
element, each row in a material takeoff represents a single
<element, material> pair.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule,
or InvalidElementId for a multi-category schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a material takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Create a key schedule.
Remarks:
A key schedule displays abstract "key" elements that can be used to
populate parameters of ordinary model elements.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a regular schedule that can relate to a specific area scheme.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
areaSchemeId:
The ID of an area scheme in an area schedule, InvalidElementId otherwise.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
In a non-area schedule, areaSchemeId is not InvalidElementId.
-or-
In an area schedule, areaSchemeId is not the ID of an area scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a regular schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
The Areas category was specified but an area scheme ID was not provided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsHeaderFrozen
A static property defining if the schedule header frozen setting is turned on or off in current Revit Application Session.
Remarks:
The setting will be written into Revit.ini if users set the value.
If users start multiple Revit sessions, the schedule header frozen setting might be different in each session.
Revit.ini file stores the lastest setting no matter what the Revit session is.
Since:
2020.1

Autodesk.Revit.DB.ViewSchedule.UseStripedRowsOnSheets
Indicates whether a property setting of true will also change the display of this schedule to show striped rows on a sheet.
If true, setting that property to true will also change the display.
If false, striped rows will not display for this schedule on a sheet no matter what value is set for HasStripedRows.
Remarks:
Striped rows on sheets can be overidden by shading or conditional formatting.
Since:
2021

Autodesk.Revit.DB.ViewSchedule.HasStripedRows
Indicates whether this schedule has striped rows.
Remarks:
Striped rows can be overridden by shading or conditional formatting.
Since:
2020.1

Autodesk.Revit.DB.ViewSchedule.RowHeightOverride
Defines the override that is applied to the row height.
Remarks:
Setting this property to anything but Autodesk.Revit.DB.RowHeightOverrideOptions.None will allow setting the Autodesk.Revit.DB.ViewSchedule.RowHeight property.
This is taken into account when the schedule is viewed as a ScheduleSheetInstance on a ViewSheet.
Autodesk.Revit.DB.RowHeightOverrideOptions.None to disable row height override.
Autodesk.Revit.DB.RowHeightOverrideOptions.All enables row height override for all the body rows in the schedule.
Autodesk.Revit.DB.RowHeightOverrideOptions.ImageRows enables row height override for all the schedule body rows that contains images or custom graphics.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.ViewSchedule.RowHeight
Defines the schedule body rows height.
Remarks:
Setting this property will force all or image only (depending on how Autodesk.Revit.DB.ViewSchedule.RowHeightOverride is defined) schedule body rows to be resized to the indicated height value (when viewed as a ScheduleSheetInstance on a ViewSheet).
If the value that is set is smaller than the height of the text (single or multi line), then that value is not taken into account.
To access or set this property the Autodesk.Revit.DB.ViewSchedule.RowHeightOverride property should not be Autodesk.Revit.DB.RowHeightOverrideOptions.None
The row height for any body rows in the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rowHeight must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RowHeightOverride property is set to RowHeightOverrideOptions.None.
Since:
2024

Autodesk.Revit.DB.ViewSchedule.KeyScheduleParameterName
In a key schedule, the name of the parameter for choosing one of the keys.
Remarks:
When a key schedule is created, elements of the schedule's category
receive a new parameter for choosing one of the keys defined in the key schedule.
This is the name of that parameter.
The name of the key schedule parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ViewSchedule is not key schedule.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
When setting this property: The document containing this ViewSchedule is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
When setting this property: The document containing this ViewSchedule is being loaded, or is in the midst of another
sensitive process.
-or-
When setting this property: This ViewSchedule is an internal element, such as a component of a
loaded family or a group type.
-or-
When setting this property: The document containing this ViewSchedule is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
When setting this property: This ViewSchedule is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
When setting this property: The document containing this ViewSchedule has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.BodyTextTypeId
Defines the default text style used for the data section of the schedule.
Remarks:
Columns may override the default style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ViewSchedule.HeaderTextTypeId
Defines the default text style used in the column headers in the body section of the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ViewSchedule.TitleTextTypeId
Defines the default text style used in the header section of the schedule.
Remarks:
Cells may override the default style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014